{
    "title": "The Strange Cave",
    "author": "A. J. Asplund",
    "startnode": "cover",
    "failnode": "failure",
    "nodes":
    {
    "cover":
    {
        "pagetitle": null,
        "storyText": 
        [
            {
                "text": "Welcome to The Strange Cave, a work of Interactive Fiction. Throughout this adventure, you will make decisions about what your character does. Some decisions may lead to a conclusion while others may lead to further opportunities. Choose wisely!"
            },
            {
                "text": "</p><p>That's weird. It looks like you've been here before.",
                "requirement": "p1"
            }
            
        ],
        "choices":
        [
            {
                "text": "Begin the story!",
                "destination": "p1"
            }
        ]
    },

    "p1": 
    {
        "pagetitle": "Outside of the Cave",
        "storyText": "You and your friends are standing at the entrance of a sinister looking cave. Stalactites hang from the mouth of the cave almost like sharp fangs, ready to bite down on anything that may enter. \"Are you going to go in?\" one of your friends asks you.</p><p>You were all here because you agreed to be the brave one, going inside and finding out what was in there. However, you suddenly feel a bit scared. It's a lot darker and a lot scarier than you thought it was when you decided to go in there.</p><p>Do you want to go into the cave? Or do you think you should just give up and go home?",
        "choices":
        [
            {
                "text": "Go in the cave.",
                "destination": "insidethecave-1"
            },
            {
                "text": "Give up and go home.",
                "destination": "p2"
            }
        ]
    },

    "p2" :
    {
        "pagetitle": "Outside of the Cave",
        "storyText": "\"I don't think it's safe to go inside,\" you mutter. \"Maybe we should go somewhere else.\" Your friends all look disappointingly at you. It is clear that nobody is impressed with your last minute decision to change your mind.</p><p>\"Figures. I knew you'd chicken out at the last minute. You always were the one to talk big.\" All of your friends turn and start walking away, obviously disappointed by your choice.</p><p>Do you want to turn and follow them away from the cave? Or do you swallow your fear and head into the cave?",
        "choices":
        [
            {
                "text": "Follow your friends.",
                "destination": "end-retreat"
            },
            {
                "text": "Go into the cave.",
                "destination": "p4"
            }
        ]
    },

    "end-retreat" :
    {
        "pagetitle": "On the Way Home",
        "storyText":
        [
            {
                "text": "You follow your friends all of the way back home."
            },
            {
                "text": "The whole way home, they make fun of your unwillingness to follow through with your plan to enter the cave.",
                "requirement": "p2"
            },
            {
                "text": "The whole way home, they make fun of how you ran out of the cave and tripped, falling face first into the dirt.",
                "requirement": "cave-retreat"
            },
            {
                "text": "By the time you make it back to your house, you've managed to get over your embarassment. At least mostly.</p><p>At home, one of your parents asks, \"So, what did you do today?\" They look at you, earnestly waiting for a response.</p><p>\"Nothing. Just hanging out with my friends. We went for a walk into the forest, but we did not do anything there.\"</p><p>You spend the rest of the afternoon thinking about what may have happened had you actually gone through with your adventure into the cave. Another time, maybe."
            }
        ],
        "choices":
        [
            {
                "text": "Play again?",
                "destination": "p1"
            }
        ]
    },

    "p4":
    {
        "pagetitle": "Outside of the Cave",
        "storyText": "\"Hey, everybody!\" you yell back at them. \"I changed my mind. I'm going to do it.\"</p><p>They pause and turn back. You can tell that they don't quite believe you. \"I'm serious! I'm going to do it this time.\"</p><p>They slowly walk back to the mouth of the cave, standing around you as they did before.",
        "choices":
        [
            {
                "text": "Go into the cave.",
                "destination": "insidethecave-1"
            }
        ]
    },

    "insidethecave-1":
    {
        "pagetitle": "Entering the Cave",
        "storyText": 
        [
            {
                "text": "You haven't gone that far into the cave before the light seems to disappear entirely. Looking back, you can see your friends standing outside of the entrance. It's like even the light is too afraid to go too far into this cave."
            },
            {
                "text": "You start to think that maybe you were right to think this was dangerous.",
                "requirement": "p2"
            },
            {
                "text": "</p><p>It's very dark. You can barely even see your hands in front of your face. You reach into your jacket pocket and pull out the flashlight that you brought along with you."
            }
        ],
        "choices":
        [
            {
                "text": "Switch on your flashlight.",
                "destination": "p6"
            },
            {
                "text": "Turn around and leave the cave.",
                "requirement": "!p2",
                "destination": "cave-retreat"
            },
            {
                "text": "Turn around and leave the cave.",
                "requirement": "p2",
                "destination": "no-retreat"
            }
        ]
    },
    "cave-retreat":
    {
        "storyText": "As you stumble back towards the light of the cave entrance, you see all of your friends standing right where you left them. As you escape the mouth of the cave, you trip on a rock and fall in the dirt. Your friends break into laughter.</p><p>\"Look at that! Barely a minute and you already came running out like a scaredy cat!\"</p><p>One of your friends helps you up and dusts some of the dirt off of your clothes. As the laughter subsides, somebody mentions that it's nearly sunset and that you need to head home.",
        "choices":
        [
            {
                "text": "Follow your friends home.",
                "destination": "end-retreat"
            }
        ]
    },
    "failure" :
    {
        "storyText": "This doesn't actually exist. You must have gotten here by accident, because you really shouldn't be here. Maybe you need to start over?",
        "choices":
        [
            {
                "text": "Begin again?",
                "destination": "p1"
            }
        ]
    }
    }
}